app/Controllers/ClientOperation.php

    public function depotForm()
    {
        $compteId = session()->get('compte_id');
    $compteModel = new ClientModel();
    $compte = $compteModel->find($compteId);
---
SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1

    public function retraitForm()
{
    $compteId = session()->get('compte_id');
    $compteModel = new ClientModel();
    $compte = $compteModel->find($compteId);
---
SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1

public function transfertForm()
{
    $compteId = session()->get('compte_id');
    $compteModel = new ClientModel();
    $compte = $compteModel->find($compteId);

    return view('clients/transfert', [
        'compte'  => $compte,
        'comptes' => $compteModel->findAll(),
    ]);
---
SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1
SELECT *
FROM `comptes`

public function transfertStore()
{
    $compteId       = session()->get('compte_id');
    $numeroDestinataire = trim((string) $this->request->getPost('numero_destinataire'));
    $montant        = (float) $this->request->getPost('montant');
    $dateTransfert  = $this->request->getPost('date_transfert') ?: date('Y-m-d H:i:s');

    if ($montant <= 0) {
        return redirect()->back()->withInput()->with('error', 'Le montant doit être supérieur à 0.');
    }

    $compteModel = new ClientModel();
    $compteOrigine = $compteModel->find($compteId);
---
SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1