app/Controllers/Livres.php

    public function show(int $id)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 1

        }

        try {
            if (! $livreModel->insert($donnees)) {
---
INSERT INTO `livres` (`titre`, `auteur`, `isbn`, `annee_publication`, `categorie`, `resume`, `statut`, `couverture_fichier`, `created_at`, `updated_at`) VALUES ('test', 'Anthonio', '123', '2022', 'Roman', 'test', 'disponible', '1777287823_5a7e495a2aaef71fb878.png', '2026-04-27 11:03:43', '2026-04-27 11:03:43')

    public function preter(int $id)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($id);
        if ($livre === null) {
            return redirect()->to('/')->with('error', 'Le livre demandé est introuvable.');
        }

        if (($livre['statut'] ?? null) !== 'disponible') {
            return redirect()->back()->with('error', 'Ce livre est déjà prêté.');
        }

        $nomEmprunteur = trim((string) $this->request->getPost('nom_emprunteur'));
        if ($nomEmprunteur === '') {
            return redirect()->back()->withInput()->with('error', 'Le nom de l\'emprunteur est obligatoire.');
        }

        $db = db_connect();
        $db->transStart();

        $empruntModel->insert([
            'livre_id' => $id,
            'nom_emprunteur' => $nomEmprunteur,
            'date_emprunt' => date('Y-m-d'),
            'date_retour' => null,
        ]);

        $livreModel->update($id, [
            'statut' => 'prete',
        ]);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 1
INSERT INTO `emprunts` (`livre_id`, `nom_emprunteur`, `date_emprunt`, `date_retour`) VALUES (1, 'Elia', '2026-04-27', NULL)
UPDATE `livres` SET `statut` = 'prete', `updated_at` = '2026-04-27 11:04:01'
WHERE `livres`.`id` IN (1)

    public function retour(int $id)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($id);
        if ($livre === null) {
            return redirect()->to('/')->with('error', 'Le livre demandé est introuvable.');
        }

        $empruntActif = $empruntModel->where('livre_id', $id)
            ->where('date_retour', null)
            ->orderBy('date_emprunt', 'DESC')
            ->orderBy('id', 'DESC')
            ->first();

        if ($empruntActif === null) {
            return redirect()->back()->with('error', 'Aucun emprunt actif n\'a été trouvé pour ce livre.');
        }

        $db = db_connect();
        $db->transStart();

        $empruntModel->update($empruntActif['id'], [
            'date_retour' => date('Y-m-d'),
        ]);

        $livreModel->update($id, [
            'statut' => 'disponible',
        ]);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 1
SELECT *
FROM `emprunts`
WHERE `livre_id` = 1
AND `date_retour` IS NULL
ORDER BY `date_emprunt` DESC, `id` DESC
 LIMIT 1
UPDATE `emprunts` SET `date_retour` = '2026-04-27'
WHERE `emprunts`.`id` IN ('1')
UPDATE `livres` SET `statut` = 'disponible', `updated_at` = '2026-04-27 11:04:11'
WHERE `livres`.`id` IN (1)