app/Models/ClientTransactionModel.php

SELECT `transactions`.`id`, `transactions`.`date_operation`, `transactions`.`montant`, `baremes_frais`.`frais` AS `montant_frais`, `types_operations`.`code` AS `type_code`, `types_operations`.`libelle` AS `type_libelle`, `emetteur`.`numero_telephone` AS `compte_emetteur`, `destinataire`.`numero_telephone` AS `compte_destinataire`
FROM `transactions`
JOIN `types_operations` ON `types_operations`.`id` = `transactions`.`type_operation_id`
JOIN `baremes_frais` ON `baremes_frais`.`id` = `transactions`.`baremes_frais_id`
JOIN `comptes` AS `emetteur` ON `emetteur`.`id` = `transactions`.`compte_id`
LEFT JOIN `comptes` AS `destinataire` ON `destinataire`.`id` = `transactions`.`compte_destination_id`
WHERE `transactions`.`compte_id` = 1
OR `transactions`.`compte_destination_id` = 1
ORDER BY `transactions`.`date_operation` DESC
---
    public function historiquePourCompte(int $compteId): array
{
    return $this->select('
            transactions.id,
            transactions.date_operation,
            transactions.montant AS montant,
            transactions.commission AS commission,
            transactions.inclure_frais_retrait,
            baremes_frais.frais AS montant_frais,
            types_operations.code AS type_code,
            types_operations.libelle AS type_libelle,
            emetteur.numero_telephone AS compte_emetteur,
            destinataire.numero_telephone AS compte_destinataire
        ')
        ->join('types_operations', 'types_operations.id = transactions.type_operation_id')
        ->join('baremes_frais', 'baremes_frais.id = transactions.baremes_frais_id')
        ->join('comptes AS emetteur', 'emetteur.id = transactions.compte_id')
        ->join('comptes AS destinataire', 'destinataire.id = transactions.compte_destination_id', 'left')
        ->where('transactions.compte_id', $compteId)
        ->orWhere('transactions.compte_destination_id', $compteId)
        ->orderBy('transactions.date_operation', 'DESC')
        ->findAll();