app/Models/ClientPrefixeModel.php

SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'
AND `actif` = 1
 LIMIT 1
---
    public function estValide(string $numero): bool
    {
        $prefixe = substr($numero, 0, 3); // les 3 premiers chiffres

        return $this->where('prefixe', $prefixe)
                     ->where('actif', 1)
                     ->first() !== null;