app/Models/CompteOperatorModel.php

SELECT *
FROM `comptes`
ORDER BY `id` ASC
---
    public function getSituationCompte(): array
    {
        return $this->orderBy('id', 'ASC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `comptes`
---
    public function countAllClients(): int
    {
        return $this->countAllResults();

SELECT COALESCE(SUM(solde), 0) AS total
FROM `comptes`
---
    public function totalMontantDetenu(): float
    {
        return (float) $this->builder()
            ->select('COALESCE(SUM(solde), 0) AS total')
            ->get()
            ->getRow()
            ->total ?? 0.0;

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 3
SELECT COALESCE(SUM(CASE WHEN t.type_operation_id = 1 THEN t.montant ELSE 0 END), 0) AS total_depots, COALESCE(SUM(CASE WHEN t.type_operation_id = 2 THEN t.montant ELSE 0 END), 0) AS total_retraits, COALESCE(SUM(CASE WHEN t.type_operation_id = 3 THEN t.montant ELSE 0 END), 0) AS total_transferts
FROM `transactions` `t`
WHERE `t`.`compte_id` = 3
OR `t`.`compte_destination_id` = 3
---
    public function getSituationCompteParIdWithTransactions(int $id): ?array
    {
        $compte = $this->find($id);
        if ($compte === null) {
            return null;
        }

        $builder = $this->db->table('transactions t');
        $compte['situation'] = $builder
            ->select('
                COALESCE(SUM(CASE WHEN t.type_operation_id = 1 THEN t.montant ELSE 0 END), 0) AS total_depots,
                COALESCE(SUM(CASE WHEN t.type_operation_id = 2 THEN t.montant ELSE 0 END), 0) AS total_retraits,
                COALESCE(SUM(CASE WHEN t.type_operation_id = 3 THEN t.montant ELSE 0 END), 0) AS total_transferts
            ')
            ->where('t.compte_id', $id)
            ->orWhere('t.compte_destination_id', $id)
            ->get()
            ->getRowArray();