app/Models/ConfigurationOperatorModel.php

SELECT *
FROM `prefixes`
ORDER BY `id` ASC
---
    public function getPrefixes(): array
    {
        return $this->db->table('prefixes')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `types_operations`
ORDER BY `id` ASC
---
    public function getTypesOperations(): array
    {
        return $this->db->table('types_operations')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();

SELECT `bf`.*, `to2`.`libelle` AS `type_libelle`, `to2`.`code` AS `type_code`
FROM `baremes_frais` `bf`
JOIN `types_operations` `to2` ON `bf`.`type_operation_id` = `to2`.`id`
ORDER BY `bf`.`type_operation_id` ASC, `bf`.`montant_min` ASC
---
    public function getBaremes(): array
    {
        return $this->db->table('baremes_frais bf')
            ->select('bf.*, to2.libelle AS type_libelle, to2.code AS type_code')
            ->join('types_operations to2', 'bf.type_operation_id = to2.id')
            ->orderBy('bf.type_operation_id', 'ASC')
            ->orderBy('bf.montant_min', 'ASC')
            ->get()
            ->getResultArray();