app/Models/EmpruntModel.php

    public function dernierEmpruntPourLivre(int $livreId): ?array
    {
        return $this->where('livre_id', $livreId)
            ->orderBy('date_emprunt', 'DESC')
            ->orderBy('id', 'DESC')
            ->first();
---
SELECT *
FROM `emprunts`
WHERE `livre_id` = 1
ORDER BY `date_emprunt` DESC, `id` DESC
 LIMIT 1