app/Models/LivreModel.php

    public function rechercherLivres(?string $motCle = null, ?string $categorie = null)
    {
        $builder = $this->builder();

        if ($motCle !== null && $motCle !== '') {
            $builder->like('titre', $motCle);
        }

        if ($categorie !== null && $categorie !== '') {
            $builder->where('categorie', $categorie);
        }

        return $builder->orderBy('titre', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `livres`
WHERE `titre` LIKE '%te%' ESCAPE '!'
ORDER BY `titre` ASC

    public function livresPagine(): array
    {
        return $this->orderBy('titre', 'ASC')->paginate(10);
---
SELECT *
FROM `livres`
ORDER BY `titre` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `livres`