app/Models/TransactionOperatorModel.php

    public function totalFrais(): float
    {
        return (float) $this->builder()
            ->select('COALESCE(SUM(bf.frais), 0) AS total')
            ->join('baremes_frais bf', 'transactions.baremes_frais_id = bf.id')
            ->whereIn('transactions.type_operation_id', [2, 3])
            ->get()
            ->getRow()
            ->total ?? 0.0;
---
SELECT COALESCE(SUM(bf.frais), 0) AS total
FROM `transactions`
JOIN `baremes_frais` `bf` ON `transactions`.`baremes_frais_id` = `bf`.`id`
WHERE `transactions`.`type_operation_id` IN (2,3)